Repository: DanielSzoska/djep
Catalog: pyconde/core/locale/*/LC_MESSAGES/djangojs.po
Languages: de

source: Choose a file
de: Datei wählen

source: An error has occurred. Please try again.
de: Es ist ein Fehler aufgetreten, bitte versuchen Sie es erneut.

source: Invalid name.
de: Ungültiger Name.

source: Please verify the expiration date of your credit card.
de: Bitte überprüfen Sie das Ablaufdatum ihrer Karte.

source: 3D Secure check has been aborted.
de: 3D-Secure-Check wurde abgebrochen.

source: Please enter a valid credit card number.
de: Bitte geben Sie eine gültige Kartennummer an.

source: Please enter a valid bank account number.
de: Bitte geben Sie eine gültige Kontonummer an.

source: Please enter a valid bank routing number.
de: Bitte geben Sie eine BLZ ein.

source: This card is not valid.
de: Diese Karte ist nicht gültig.

source: Invalid CVC.
de: Ungültige Prüfziffer.
